Tekla Open API Reference for Tekla Structures 2025
ModelObject.SetUserProperty Method (String, Double)
 Sets a double property for the model object.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SetUserProperty(
	string name,
	double value
)
Public Function SetUserProperty (
	name As String,
	value As Double
) As Boolean
Parameters
name
Type: System.String
The name of the property to be set.
value
Type: System.Double
The new value for the property.
Return Value
Type: Boolean
True if the property was set successfully.
See Also
Reference
ModelObject Class
SetUserProperty Overload
Tekla.Structures.Model Namespace